In [19]:
import mysql.connector
from mysql.connector import errorcode
from sqlalchemy import create_engine
import pandas as pd
import itertools as it

In [20]:
df = pd.read_csv("df_final.csv")
df.head()

,age,attrition,business_travel,daily_rate,department,distance_from_home,education,education_field,employee_number,environment_satisfaction,...,salary,remote_work,iter_hourly_rate,iter_total_working_years,iter_monthly_income,iter_salary,knn_hourly_rate,knn_total_working_years,knn_monthly_income,knn_salary
0,51,no,NaN,2015.72,NaN,6,3,NaN,1,low,...,195370.000000,yes,83.042302,11.318934,16280.830000,195370.000000,83.042302,11.318934,16280.830000,195370.000000
1,52,no,NaN,2063.39,NaN,1,4,life_sciences,2,high,...,199990.000000,yes,83.042302,34.000000,5697.600227,199990.000000,83.042302,34.000000,5697.600227,199990.000000
2,42,no,travel_rarely,1984.25,research_&_development,4,2,technical_degree,3,high,...,192320.000000,yes,83.042302,22.000000,5697.600227,192320.000000,83.042302,22.000000,5697.600227,192320.000000
3,47,no,travel_rarely,1771.40,NaN,2,4,medical,4,low,...,171690.000000,no,83.042302,11.318934,14307.500000,171690.000000,83.042302,11.318934,14307.500000,171690.000000
4,46,no,NaN,1582.77,NaN,3,3,technical_degree,5,low,...,79832.804746,no,83.042302,11.318934,12783.920000,65245.875313,83.042302,11.318934,12783.920000,65245.875313

In [21]:
df.columns

Index(['age', 'attrition', 'business_travel', 'daily_rate', 'department',
       'distance_from_home', 'education', 'education_field', 'employee_number',
       'environment_satisfaction', 'gender', 'hourly_rate', 'job_involvement',
       'job_level', 'job_role', 'job_satisfaction', 'marital_status',
       'monthly_income', 'monthly_rate', 'num_companies_worked', 'overtime',
       'percent_salary_hike', 'performance_rating',
       'relationship_satisfaction', 'standard_hours', 'stock_option_level',
       'total_working_years', 'training_times_last_year', 'work_life_balance',
       'years_at_company', 'years_since_last_promotion',
       'years_with_curr_manager', 'date_birth', 'salary', 'remote_work',
       'iter_hourly_rate', 'iter_total_working_years', 'iter_monthly_income',
       'iter_salary', 'knn_hourly_rate', 'knn_total_working_years',
       'knn_monthly_income', 'knn_salary'],
      dtype='object')

# Creating tables

Table 1 - Employees (primary_key: employee_number)    
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Table 4 - education: education_id + education_category  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Table 5 - education_field: education_field_id + education_field  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Table 7 - gender: gender_id + gender  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Table 10 - marital_status: marital_status_id + marital_status  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Table 12 - stock_option_level: stock_option_level_id + stock_option_level (numerica)
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Tables - Salaries  

->Table 2 - Identificador de trabajos Tipologias de trabajo  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Table 2 - business_travel: business_travel_id + business_travel_category  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Table 11 - standard_hours: standard_hours_id + standard_hours_category     
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Table - Remote work

-> Table 3 - scale_1_4: scale_id + scale_level  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; environment_satisfaction   
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; job_satisfaction  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; relationship_satisfaction   
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; job_involvement  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Table 13 - work_life_balance: work_life_balance_id + work_life_balance_category    

-> Table 4 - Department_Role  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Table 3 - department: department_id + department_name  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Table 8 - job_level: job_level_id + job_level  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Table 9 - job_role: job_role_id + job_role

In [22]:
# Table 2 - Work Typologies
# Create list of the typologies characteristics
categories1 = df['business_travel'].unique().tolist()
categories2 = df['standard_hours'].unique().tolist()
categories3 = df['remote_work'].unique().tolist()

# Create DataFrames (df) based on the litsts
work_typologies1 = pd.DataFrame({'category_travel': categories1})
work_typologies2 = pd.DataFrame({'category_std_hours': categories2})
work_typologies3 = pd.DataFrame({'category_remote': categories3})

# Create a mapping order for the characteristics
order_mapping1 = {'non_travel': 1, 'travel_rarely': 2, 'travel_frequently': 3, 'NaN': 4}
order_mapping2 = {'full_time': 1, 'part_time': 2, 'NaN': 3}
order_mapping3 = {'yes': 1, 'no': 2, 'NaN': 3}

# Sort using custom mapping
work_typologies1 = work_typologies1.assign(sort_order = lambda work_typologies1: work_typologies1['category_travel'].map(order_mapping1)).sort_values('sort_order').drop('sort_order', axis=1)
work_typologies2 = work_typologies2.assign(sort_order = lambda work_typologies2: work_typologies2['category_std_hours'].map(order_mapping2)).sort_values('sort_order').drop('sort_order', axis=1)
work_typologies3 = work_typologies3.assign(sort_order = lambda work_typologies3: work_typologies3['category_remote'].map(order_mapping3)).sort_values('sort_order').drop('sort_order', axis=1)

# Assign an _id
work_typologies1.loc[work_typologies1['category_travel'] == 'non_travel', 'travel_id'] = 1
work_typologies1.loc[work_typologies1['category_travel'] == 'travel_rarely', 'travel_id'] = 2
work_typologies1.loc[work_typologies1['category_travel'] == 'travel_frequently', 'travel_id'] = 3

work_typologies2.loc[work_typologies2['category_std_hours'] == 'full_time', 'std_hours_id'] = 1
work_typologies2.loc[work_typologies2['category_std_hours'] == 'part_time', 'std_hours_id'] = 2


work_typologies3.loc[work_typologies3['category_remote'] == 'yes', 'remote_id'] = 1
work_typologies3.loc[work_typologies3['category_remote'] == 'no', 'remote_id'] = 2

# Round _id, allowing for NaN values
work_typologies1['travel_id'] = work_typologies1['travel_id'].round().astype('Int64') # Use 'Int64' to handle NaN values
work_typologies2['std_hours_id'] = work_typologies2['std_hours_id'].round().astype('Int64') # Use 'Int64' to handle NaN values
work_typologies3['remote_id'] = work_typologies3['remote_id'].round().astype('Int64') # Use 'Int64' to handle NaN values

# Combine the characteristics
cross_joined_df1 = work_typologies1.merge(work_typologies2, how = 'cross')
cross_joined_df2 = cross_joined_df1.merge(work_typologies3, how = 'cross')
cross_joined_df2 = cross_joined_df2.drop_duplicates()

# Create typology_id based on characteristics' categories_id
cross_joined_df2['typology_id'] = cross_joined_df2['travel_id']*100 + cross_joined_df2['std_hours_id']*10 + cross_joined_df2['remote_id'] 
mask = pd.isna(cross_joined_df2['typology_id'])
cross_joined_df2.loc[mask, 'typology_id'] = (cross_joined_df2.loc[mask, 'std_hours_id'] * 10 + cross_joined_df2.loc[mask, 'remote_id'])

# Create typology based on characteristics' categories
cross_joined_df2['typology'] = cross_joined_df2['category_travel'] + ', ' + cross_joined_df2['category_std_hours']+ ', ' + cross_joined_df2['category_remote'] +' remote' 
mask = pd.isna(cross_joined_df2['typology'])
cross_joined_df2.loc[mask, 'typology'] = (cross_joined_df2.loc[mask, 'category_std_hours'] + ', ' + cross_joined_df2.loc[mask, 'category_remote'] +' remote')

print(cross_joined_df2[['travel_id','std_hours_id','remote_id','typology_id','typology']])

table2 = cross_joined_df2.copy()
table2.to_csv("typologies.csv", index=False)

    travel_id  std_hours_id  remote_id  typology_id  \
0           1             1          1          111
1           1             1          2          112
2           1             2          1          121
3           1             2          2          122
4           2             1          1          211
5           2             1          2          212
6           2             2          1          221
7           2             2          2          222
8           3             1          1          311
9           3             1          2          312
10          3             2          1          321
11          3             2          2          322
12       <NA>             1          1           11
13       <NA>             1          2           12
14       <NA>             2          1           21
15       <NA>             2          2           22

                                    typology
0          non_travel, full_time, yes remote
1           non_travel, full_time, no remote
2          non_travel, part_time, yes remote
3           non_travel, part_time, no remote
4       travel_rarely, full_time, yes remote
5        travel_rarely, full_time, no remote
6       travel_rarely, part_time, yes remote
7        travel_rarely, part_time, no remote
8   travel_frequently, full_time, yes remote
9    travel_frequently, full_time, no remote
10  travel_frequently, part_time, yes remote
11   travel_frequently, part_time, no remote
12                     full_time, yes remote
13                      full_time, no remote
14                     part_time, yes remote
15                      part_time, no remote

In [23]:
# Table 3 - Satisfaction_and_involvment
# Create list of the satisfaction characteristics
categories1 = df['environment_satisfaction'].unique().tolist()
categories2 = df['job_satisfaction'].unique().tolist()
categories3 = df['job_involvement'].unique().tolist()
categories4 = df['relationship_satisfaction'].unique().tolist()
categories5 = df['work_life_balance'].unique().tolist()

# Create DataFrames (df) based on the litsts
satisfaction_typologies1 = pd.DataFrame({'category_environment': categories1})
satisfaction_typologies2 = pd.DataFrame({'category_job_satisfaction': categories2})
satisfaction_typologies3 = pd.DataFrame({'category_job_involvment': categories3})
satisfaction_typologies4 = pd.DataFrame({'category_relationship': categories4})
satisfaction_typologies5 = pd.DataFrame({'category_balance': categories5})

# Create a mapping order for the characteristics
order_mapping1 = {'low': 1, 'medium': 2, 'high': 3, 'very_high': 4, 'NaN': 5}
order_mapping5 = {'very_low': 1, 'low': 2, 'good': 3, 'excellent': 4, 'NaN': 5}

# Sort using custom mapping
satisfaction_typologies1 = satisfaction_typologies1.assign(sort_order = lambda satisfaction_typologies1: satisfaction_typologies1['category_environment'].map(order_mapping1)).sort_values('sort_order').drop('sort_order', axis=1)
satisfaction_typologies2 = satisfaction_typologies2.assign(sort_order = lambda satisfaction_typologies2: satisfaction_typologies2['category_job_satisfaction'].map(order_mapping1)).sort_values('sort_order').drop('sort_order', axis=1)
satisfaction_typologies3 = satisfaction_typologies3.assign(sort_order = lambda satisfaction_typologies3: satisfaction_typologies3['category_job_involvment'].map(order_mapping1)).sort_values('sort_order').drop('sort_order', axis=1)
satisfaction_typologies4 = satisfaction_typologies4.assign(sort_order = lambda satisfaction_typologies4: satisfaction_typologies4['category_relationship'].map(order_mapping1)).sort_values('sort_order').drop('sort_order', axis=1)
satisfaction_typologies5 = satisfaction_typologies5.assign(sort_order = lambda satisfaction_typologies5: satisfaction_typologies5['category_balance'].map(order_mapping5)).sort_values('sort_order').drop('sort_order', axis=1)

# Assign an _id
satisfaction_typologies1.loc[satisfaction_typologies1['category_environment'] == 'low', 'environment_id'] = 1
satisfaction_typologies1.loc[satisfaction_typologies1['category_environment'] == 'medium', 'environment_id'] = 2
satisfaction_typologies1.loc[satisfaction_typologies1['category_environment'] == 'high', 'environment_id'] = 3
satisfaction_typologies1.loc[satisfaction_typologies1['category_environment'] == 'very_high', 'environment_id'] = 4
satisfaction_typologies1.loc[satisfaction_typologies1['category_environment'] == 'NaN', 'environment_id'] = 5

satisfaction_typologies2.loc[satisfaction_typologies2['category_job_satisfaction'] == 'low', 'job_satisfaction_id'] = 1
satisfaction_typologies2.loc[satisfaction_typologies2['category_job_satisfaction'] == 'medium', 'job_satisfaction_id'] = 2
satisfaction_typologies2.loc[satisfaction_typologies2['category_job_satisfaction'] == 'high', 'job_satisfaction_id'] = 3
satisfaction_typologies2.loc[satisfaction_typologies2['category_job_satisfaction'] == 'very_high', 'job_satisfaction_id'] = 4
satisfaction_typologies2.loc[satisfaction_typologies2['category_job_satisfaction'] == 'NaN', 'job_satisfaction_id'] = 5

satisfaction_typologies3.loc[satisfaction_typologies3['category_job_involvment'] == 'low', 'job_involvment_id'] = 1
satisfaction_typologies3.loc[satisfaction_typologies3['category_job_involvment'] == 'medium', 'job_involvment_id'] = 2
satisfaction_typologies3.loc[satisfaction_typologies3['category_job_involvment'] == 'high', 'job_involvment_id'] = 3
satisfaction_typologies3.loc[satisfaction_typologies3['category_job_involvment'] == 'very_high', 'job_involvment_id'] = 4
satisfaction_typologies3.loc[satisfaction_typologies3['category_job_involvment'] == 'NaN', 'job_involvment_id'] = 5

satisfaction_typologies4.loc[satisfaction_typologies4['category_relationship'] == 'low', 'relationship_id'] = 1
satisfaction_typologies4.loc[satisfaction_typologies4['category_relationship'] == 'medium', 'relationship_id'] = 2
satisfaction_typologies4.loc[satisfaction_typologies4['category_relationship'] == 'high', 'relationship_id'] = 3
satisfaction_typologies4.loc[satisfaction_typologies4['category_relationship'] == 'very_high', 'relationship_id'] = 4
satisfaction_typologies4.loc[satisfaction_typologies4['category_relationship'] == 'NaN', 'relationship_id'] = 4

satisfaction_typologies5.loc[satisfaction_typologies5['category_balance'] == 'very_low', 'balance_id'] = 1
satisfaction_typologies5.loc[satisfaction_typologies5['category_balance'] == 'low', 'balance_id'] = 2
satisfaction_typologies5.loc[satisfaction_typologies5['category_balance'] == 'good', 'balance_id'] = 3
satisfaction_typologies5.loc[satisfaction_typologies5['category_balance'] == 'excellent', 'balance_id'] = 4
satisfaction_typologies5.loc[satisfaction_typologies5['category_balance'] == 'NaN', 'balance_id'] = 5

# Round _id, allowing for NaN values
satisfaction_typologies1['environment_id'] = satisfaction_typologies1['environment_id'].round().astype('Int64') # Use 'Int64' to handle NaN values
satisfaction_typologies2['job_satisfaction_id'] = satisfaction_typologies2['job_satisfaction_id'].round().astype('Int64') # Use 'Int64' to handle NaN values
satisfaction_typologies3['job_involvment_id'] = satisfaction_typologies3['job_involvment_id'].round().astype('Int64') # Use 'Int64' to handle NaN values
satisfaction_typologies4['relationship_id'] = satisfaction_typologies4['relationship_id'].round().astype('Int64') # Use 'Int64' to handle NaN values
satisfaction_typologies5['balance_id'] = satisfaction_typologies5['balance_id'].round().astype('Int64') # Use 'Int64' to handle NaN values

# Combine the characteristics
cross_joined_df1 = satisfaction_typologies1.merge(satisfaction_typologies2, how = 'cross')
cross_joined_df2 = cross_joined_df1.merge(satisfaction_typologies3, how = 'cross')
cross_joined_df3 = cross_joined_df2.merge(satisfaction_typologies4, how = 'cross')
cross_joined_df4 = cross_joined_df3.merge(satisfaction_typologies5, how = 'cross')
cross_joined_df4 = cross_joined_df4.drop_duplicates()

# Create typology_id based on characteristics' categories_id
cross_joined_df4['satisfaction_id'] = (cross_joined_df4['environment_id']*10000 + cross_joined_df4['job_satisfaction_id']*1000 + cross_joined_df4['job_involvment_id']*100 + 
                                       cross_joined_df4['relationship_id']*10 + cross_joined_df4['balance_id']*1)
mask = pd.isna(cross_joined_df4['satisfaction_id'])
cross_joined_df4.loc[mask, 'satisfaction_id'] = (cross_joined_df4.loc[mask, 'job_satisfaction_id'] * 1000 + cross_joined_df4.loc[mask, 'job_involvment_id']*100 + 
                                             cross_joined_df4.loc[mask, 'relationship_id'] * 10 + cross_joined_df4.loc[mask, 'balance_id'] * 1)

# Create typology based on characteristics' categories
cross_joined_df4['satisfaction'] = (cross_joined_df4['category_environment'] + ', ' + cross_joined_df4['category_job_satisfaction']+ ', ' + cross_joined_df4['category_job_involvment'] +
                                    ', ' + cross_joined_df4['category_relationship']+ ', ' + cross_joined_df4['category_balance'])
mask = pd.isna(cross_joined_df4['satisfaction'])
cross_joined_df4.loc[mask, 'satisfaction'] = ('environment_missing' + ' ,' + cross_joined_df4.loc[mask, 'category_job_satisfaction'] + ', ' + cross_joined_df4.loc[mask, 'category_job_involvment'] +
                                              ', ' + cross_joined_df4.loc[mask, 'category_relationship'] + ', ' + cross_joined_df4.loc[mask, 'category_balance'])

cross_joined_df4[['environment_id','job_satisfaction_id','job_involvment_id','relationship_id','balance_id', 'satisfaction_id', 'satisfaction']]

table3 = cross_joined_df4.copy()
table3.to_csv("satisfaction_involvment.csv", index=False)

In [24]:
# Table 4 - Department_role
# Create list of the department_role categories
categories1 = df['department'].unique().tolist()
categories2 = df['job_level'].unique().tolist()
categories3 = df['job_role'].unique().tolist()

# Create DataFrames (df) based on the litsts
department_role1 = pd.DataFrame({'category_department': categories1})
department_role2 = pd.DataFrame({'category_level': categories2})
department_role3 = pd.DataFrame({'category_role': categories3})

# Create a mapping order for the characteristics
order_mapping1 = {'research_&_development': 1, 'sales': 2, 'human_resources': 3, 'NaN': 4}
order_mapping2 = {'entry_level': 1, 'manager': 2, 'executive': 3, 'intermediate': 4, 'senior': 5, 'NaN': 6}
order_mapping3 = {'research_director': 1, 'manager': 2, 'sales_executive': 3, 'manufacturing_director': 4, 'research_scientist': 5,
                    'healthcare_representative': 6, 'laboratory_technician': 7, 'sales_representative': 8, 'human_resources': 9, 'NaN': 10}

# Sort using custom mapping
department_role1 = department_role1.assign(sort_order = lambda department_role1: department_role1['category_department'].map(order_mapping1)).sort_values('sort_order').drop('sort_order', axis=1)
department_role2 = department_role2.assign(sort_order = lambda department_role2: department_role2['category_level'].map(order_mapping2)).sort_values('sort_order').drop('sort_order', axis=1)
department_role3 = department_role3.assign(sort_order = lambda department_role3: department_role3['category_role'].map(order_mapping3)).sort_values('sort_order').drop('sort_order', axis=1)

# Assign an _id
department_role1.loc[department_role1['category_department'] == 'research_&_development', 'department_id'] = 1
department_role1.loc[department_role1['category_department'] == 'sales', 'department_id'] = 2
department_role1.loc[department_role1['category_department'] == 'human_resources', 'department_id'] = 3

department_role2.loc[department_role2['category_level'] == 'entry_level', 'level_id'] = 1
department_role2.loc[department_role2['category_level'] == 'manager', 'level_id'] = 2
department_role2.loc[department_role2['category_level'] == 'executive', 'level_id'] = 3
department_role2.loc[department_role2['category_level'] == 'intermediate', 'level_id'] = 4
department_role2.loc[department_role2['category_level'] == 'senior', 'level_id'] = 5

department_role3.loc[department_role3['category_role'] == 'research_director', 'role_id'] = 1
department_role3.loc[department_role3['category_role'] == 'manager', 'role_id'] = 2
department_role3.loc[department_role3['category_role'] == 'sales_executive', 'role_id'] = 3
department_role3.loc[department_role3['category_role'] == 'manufacturing_director', 'role_id'] = 4
department_role3.loc[department_role3['category_role'] == 'research_scientist', 'role_id'] = 5
department_role3.loc[department_role3['category_role'] == 'healthcare_representative', 'role_id'] = 6
department_role3.loc[department_role3['category_role'] == 'laboratory_technician', 'role_id'] = 7
department_role3.loc[department_role3['category_role'] == 'sales_representative', 'role_id'] = 8
department_role3.loc[department_role3['category_role'] == 'human_resources', 'role_id'] = 9

# Round _id, allowing for NaN values
department_role1['department_id'] = department_role1['department_id'].round().astype('Int64') # Use 'Int64' to handle NaN values
department_role2['level_id'] = department_role2['level_id'].round().astype('Int64') # Use 'Int64' to handle NaN values
department_role3['role_id'] = department_role3['role_id'].round().astype('Int64') # Use 'Int64' to handle NaN values

# Combine the characteristics
cross_joined_df1 = department_role1.merge(department_role2, how = 'cross')
cross_joined_df2 = cross_joined_df1.merge(department_role3, how = 'cross')
cross_joined_df2 = cross_joined_df2.drop_duplicates()

# Create typology_id based on characteristics' categories_id
cross_joined_df2['department_role_id'] = cross_joined_df2['department_id']*100 + cross_joined_df2['level_id']*10 + cross_joined_df2['role_id'] 
mask = pd.isna(cross_joined_df2['department_role_id'])
cross_joined_df2.loc[mask, 'department_role_id'] = (cross_joined_df2.loc[mask, 'level_id'] * 10 + cross_joined_df2.loc[mask, 'role_id'])

# Create typology based on characteristics' categories
cross_joined_df2['department_role'] = cross_joined_df2['category_department'] + ', ' + cross_joined_df2['category_level']+ ', ' + cross_joined_df2['category_role'] 
mask = pd.isna(cross_joined_df2['department_role'])
cross_joined_df2.loc[mask, 'department_role'] = (cross_joined_df2.loc[mask, 'category_level'] + ', ' + cross_joined_df2.loc[mask, 'category_role'])

print(cross_joined_df2[['department_id','level_id','role_id','department_role_id','department_role']])

table4 = cross_joined_df2.copy() 
table4.to_csv("department_role.csv", index=False)

     department_id  level_id  role_id  department_role_id  \
0                1         1        1                 111
1                1         1        2                 112
2                1         1        3                 113
3                1         1        4                 114
4                1         1        5                 115
..             ...       ...      ...                 ...
175           <NA>         5        5                  55
176           <NA>         5        6                  56
177           <NA>         5        7                  57
178           <NA>         5        8                  58
179           <NA>         5        9                  59

                                       department_role
0    research_&_development, entry_level, research_...
1         research_&_development, entry_level, manager
2    research_&_development, entry_level, sales_exe...
3    research_&_development, entry_level, manufactu...
4    research_&_development, entry_level, research_...
..                                                 ...
175                         senior, research_scientist
176                  senior, healthcare_representative
177                      senior, laboratory_technician
178                       senior, sales_representative
179                            senior, human_resources

[180 rows x 5 columns]

In [25]:
# Table 1
df_employees = df.copy()
df_employees.columns
df_employees.rename(columns={"business_travel": "category_travel", "standard_hours": "category_std_hours", 'remote_work': 'category_remote',
                   'environment_satisfaction': 'category_environment', 'job_satisfaction': 'category_job_satisfaction', 'job_involvement': 'category_job_involvment',
                   'relationship_satisfaction': 'category_relationship', 'work_life_balance': 'category_balance',
                   'department': 'category_department', 'job_level': 'category_level', 'job_role': 'category_role'}, inplace=True)


df_employees = df_employees.merge(table2, on=['category_travel', 'category_std_hours', 'category_remote'], how='left')
df_employees = df_employees.merge(table3, on=['category_environment', 'category_job_satisfaction', 'category_job_involvment', 'category_relationship', 'category_balance'], how='left')
df_employees = df_employees.merge(table4, on=['category_department', 'category_level', 'category_role'], how='left')


df_employees = df_employees.loc[:, ~df_employees.columns.str.startswith('category_')]

columns = ['travel_id', 'std_hours_id', 'remote_id','environment_id', 'job_satisfaction_id', 'job_involvment_id','relationship_id',
           'balance_id', 'department_id', 'level_id', 'role_id', 'typology','satisfaction','department_role']
df_employees = df_employees.drop(columns=columns)

table1 = df_employees.copy() 
table1.to_csv("employees.csv", index=False)

In [26]:
user = 'root'
password = 'AlumnaAdalab'
host = '127.0.0.1'

# Try the connection and check the error message and code in case it is not working
try:
  cnx = mysql.connector.connect(user = user, password = password,
                                host = host)
except mysql.connector.Error as err:
  if err.errno == errorcode.ER_ACCESS_DENIED_ERROR:
    print("Something is wrong with your user name or password")
  elif err.errno == errorcode.ER_BAD_DB_ERROR:
    print("Database does not exist")
  else:
    print(err)
else:
  cnx.close()

In [27]:
import mysql.connector

# Connection parameters
user = 'root'
password = 'AlumnaAdalab'
host = '127.0.0.1'

# Connect to MySQL server
cnx = mysql.connector.connect(user=user, password=password, host=host)
mycursor = cnx.cursor()

# Try to drop the database
try:
    mycursor.execute("DROP DATABASE project_talent")
    print("Database 'project_talent' dropped successfully.")
except mysql.connector.Error as err:
    print("Failed to drop database:")
    print("Error Code:", err.errno)
    print("SQLSTATE", err.sqlstate)
    print("Message", err.msg)

# Close connection
mycursor.close()
cnx.close()

Database 'project_talent' dropped successfully.

In [28]:
user = 'root'
password = 'AlumnaAdalab'
host = '127.0.0.1'

# conexión (1)
cnx = mysql.connector.connect(user = user, password = password,
                              host = host)

# cursor (2)
mycursor = cnx.cursor()

try:
    mycursor.execute("CREATE DATABASE project_talent")
    print(mycursor)
except mysql.connector.Error as err:
    print(err)
    print("Error Code:", err.errno)
    print("SQLSTATE", err.sqlstate)
    print("Message", err.msg)

CMySQLCursor: CREATE DATABASE project_talent

In [ ]:
# Adding the data from employee.csv - data on employees
engine_route = 'mysql+mysqlconnector://root:AlumnaAdalab@127.0.0.1/project_talent'
location = 'employees.csv'

# Create the connection engine
engine = create_engine(engine_route)
# Uppload the CSV file in a DataFrame 
df = pd.read_csv(location)
# Verify that the first registries are in order
print(df.head())

   age attrition  daily_rate  distance_from_home  education   education_field  \
0   51        no     2015.72                   6          3               NaN
1   52        no     2063.39                   1          4     life_sciences
2   42        no     1984.25                   4          2  technical_degree
3   47        no     1771.40                   2          4           medical
4   46        no     1582.77                   3          3  technical_degree

   employee_number  gender  hourly_rate marital_status  ...  \
0                1  female   251.967241            NaN  ...
1                2  female   257.925812            NaN  ...
2                3  female   248.033353        married  ...
3                4    male   221.426998        married  ...
4                5    male   102.958162       divorced  ...

   iter_total_working_years  iter_monthly_income    iter_salary  \
0                 11.318934         16280.830000  195370.000000
1                 34.000000          5697.600227  199990.000000
2                 22.000000          5697.600227  192320.000000
3                 11.318934         14307.500000  171690.000000
4                 11.318934         12783.920000   65245.875313

  knn_hourly_rate  knn_total_working_years knn_monthly_income     knn_salary  \
0       83.042302                11.318934       16280.830000  195370.000000
1       83.042302                34.000000        5697.600227  199990.000000
2       83.042302                22.000000        5697.600227  192320.000000
3       83.042302                11.318934       14307.500000  171690.000000
4       83.042302                11.318934       12783.920000   65245.875313

   typology_id  satisfaction_id  department_role_id
0           11            13333                  31
1           21            33213                  32
2          221            34343                 132
3          212            13323                  21
4           22            11443                  23

[5 rows x 35 columns]

In [30]:
# send the data to 
df.to_sql("employees", engine, if_exists="append", index=False)

1614

In [ ]:
# Adding the data from typologies.csv - data on employment characteristics
engine_route = 'mysql+mysqlconnector://root:AlumnaAdalab@127.0.0.1/project_talent'
location = 'typologies.csv'

# Create the connection engine
engine = create_engine(engine_route)
# Uppload the CSV file in a DataFrame 
df = pd.read_csv(location)
# Verify that the first registries are in order
print(df.head())

  category_travel  travel_id category_std_hours  std_hours_id category_remote  \
0      non_travel        1.0          full_time             1             yes
1      non_travel        1.0          full_time             1              no
2      non_travel        1.0          part_time             2             yes
3      non_travel        1.0          part_time             2              no
4   travel_rarely        2.0          full_time             1             yes

   remote_id  typology_id                              typology
0          1          111     non_travel, full_time, yes remote
1          2          112      non_travel, full_time, no remote
2          1          121     non_travel, part_time, yes remote
3          2          122      non_travel, part_time, no remote
4          1          211  travel_rarely, full_time, yes remote

In [32]:
df.to_sql("typologies", engine, if_exists="append", index=False)

16

In [ ]:
# Adding the data from satisfaction_involment.csv - data on satisfaction metrics
engine_route = 'mysql+mysqlconnector://root:AlumnaAdalab@127.0.0.1/project_talent'
location = 'satisfaction_involvment.csv'

# Create the connection engine
engine = create_engine(engine_route)
# Uppload the CSV file in a DataFrame 
df = pd.read_csv(location)
# Verify that the first registries are in order
print(df.head())

  category_environment  environment_id category_job_satisfaction  \
0                  low             1.0                       low
1                  low             1.0                       low
2                  low             1.0                       low
3                  low             1.0                       low
4                  low             1.0                       low

   job_satisfaction_id category_job_involvment  job_involvment_id  \
0                    1                     low                  1
1                    1                     low                  1
2                    1                     low                  1
3                    1                     low                  1
4                    1                     low                  1

  category_relationship  relationship_id category_balance  balance_id  \
0                   low                1         very_low           1
1                   low                1              low           2
2                   low                1             good           3
3                   low                1        excellent           4
4                medium                2         very_low           1

   satisfaction_id                     satisfaction
0            11111     low, low, low, low, very_low
1            11112          low, low, low, low, low
2            11113         low, low, low, low, good
3            11114    low, low, low, low, excellent
4            11121  low, low, low, medium, very_low

In [34]:
df.to_sql("satisfaction_involvment", engine, if_exists="append", index=False)

1280

In [ ]:
# Adding the data from department_role.csv - data on department and role classified
engine_route = 'mysql+mysqlconnector://root:AlumnaAdalab@127.0.0.1/project_talent'
location = 'department_role.csv'

# Create the connection engine
engine = create_engine(engine_route)
# Uppload the CSV file in a DataFrame 
df = pd.read_csv(location)
# Verify that the first registries are in order
print(df.head())

      category_department  department_id category_level  level_id  \
0  research_&_development            1.0    entry_level         1
1  research_&_development            1.0    entry_level         1
2  research_&_development            1.0    entry_level         1
3  research_&_development            1.0    entry_level         1
4  research_&_development            1.0    entry_level         1

            category_role  role_id  department_role_id  \
0       research_director        1                 111
1                 manager        2                 112
2         sales_executive        3                 113
3  manufacturing_director        4                 114
4      research_scientist        5                 115

                                     department_role
0  research_&_development, entry_level, research_...
1       research_&_development, entry_level, manager
2  research_&_development, entry_level, sales_exe...
3  research_&_development, entry_level, manufactu...
4  research_&_development, entry_level, research_...

In [36]:
df.to_sql("department_role", engine, if_exists="append", index=False)

180